-------------------------------------------------------------------------------
      name:  system
       log:  /project/logs/system_22_Mar_2025-00_09_16-statauser.log
  log type:  text
 opened on:  22 Mar 2025, 00:09:16
r; t=0.00 0:09:16

. 
. /* It will provide some info about how and when the program was run */
. 
. /* install any packages locally */
. di "=== Redirecting where Stata searches for ado files ==="
=== Redirecting where Stata searches for ado files ===
r; t=0.00 0:09:16

. capture mkdir "$rootdir/ado"
r; t=0.00 0:09:16

. adopath - PERSONAL
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PLUS)      "~/ado/plus/"
  [5]  (OLDPLACE)  "~/ado/"
r; t=0.00 0:09:16

. adopath - OLDPLACE
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PLUS)      "~/ado/plus/"
r; t=0.00 0:09:16

. adopath - SITE
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]              "."
  [3]  (PLUS)      "~/ado/plus/"
r; t=0.00 0:09:16

. sysdir set PLUS     "$rootdir/ado/plus"
r; t=0.00 0:09:16

. sysdir set PERSONAL "$rootdir/ado"       // may be needed for some packages
r; t=0.00 0:09:16

. sysdir
   STATA:  /usr/local/stata/
    BASE:  /usr/local/stata/ado/base/
    SITE:  /usr/local/ado/
    PLUS:  /project/ado/plus/
PERSONAL:  /project/ado/
OLDPLACE:  ~/ado/
r; t=0.00 0:09:16

. 
. /*===========================================================================
> ===================*/
. /* If present, add the authors' replication-package specific ado file path   
>                    */
. /* This is defined above                                                     
>                    */
. /*===========================================================================
> ===================*/
. 
. if "`author_adopath'" != "" {             // The author adopath variable is f
> illed out
.     adopath ++ "$rootdir/`author_adopath'"
r; t=0.00 0:09:16
. }
r; t=0.00 0:09:16

. 
. /* now let's check what's there */
. 
. di "=== Verifying pre-existing ado files - normally, this should be EMPTY upo
> n first run"
=== Verifying pre-existing ado files - normally, this should be EMPTY upon firs
> t run
r; t=0.00 0:09:16

. adopath
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]              "."
  [3]  (PLUS)      "/project/ado/plus/"
r; t=0.00 0:09:16

. ado

[1] package gtools from http://fmwww.bc.edu/repec/bocode/g
      'GTOOLS': module to provide a fast implementation of common group command
> s

[2] package fastreshape from http://fmwww.bc.edu/repec/bocode/f
      'FASTRESHAPE': module for efficient implementation of reshape for big dat
> asets

[3] package reghdfe from http://fmwww.bc.edu/repec/bocode/r
      'REGHDFE': module to perform linear or instrumental-variable regression a
> bsorbing any number of high-dimensional fixed effects

[4] package autorename from http://fmwww.bc.edu/repec/bocode/a
      'AUTORENAME': module to automatically rename variables

[5] package ftools from http://fmwww.bc.edu/repec/bocode/f
      'FTOOLS': module to provide alternatives to common Stata commands optimiz
> ed for large datasets

[6] package cli-compat from https://raw.githubusercontent.com/aeadataeditor/cli
> -compat-stata/master
      'cli-compat': Commands that provide compatibility with programs written w
> ith GUI Stata in mind.
r; t=0.00 0:09:16

. di "=========================="
==========================
r; t=0.00 0:09:16

. 
. 
. /* this is long, so we pause the main log file */
. log off ldi
      name:  ldi
       log:  /project/logs/logfile_22_Mar_2025-00_09_16-statauser.log
  log type:  text
 paused on:  22 Mar 2025, 00:09:16
-------------------------------------------------------------------------------
r; t=0.00 0:09:16

. 
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===
r; t=0.00 0:09:16

. creturn list

System values
-------------

    ---------------------------------------------------------------------------
        c(current_date) = "22 Mar 2025"
        c(current_time) = "00:09:16"
           c(rmsg_time) = 0                          (seconds, from set rmsg)
    ---------------------------------------------------------------------------
       c(stata_version) = 18
             c(version) = 18                         (version)
         c(userversion) = 18                         (version)
      c(dyndoc_version) = 2                          (dyndoc)
    ---------------------------------------------------------------------------
           c(born_date) = "04 Apr 2024"
             c(edition) = "BE"
        c(edition_real) = "MP"
                 c(bit) = 64
                  c(SE) = 1
                  c(MP) = 1
          c(processors) = 24                         (Stata/MP, set processors)
      c(processors_lic) = 32
     c(processors_mach) = 24
      c(processors_max) = 24
       c(kmp_blocktime) = 200                        (set kmp_blocktime)
                c(mode) = "batch"
             c(console) = "console"
    ---------------------------------------------------------------------------
                  c(os) = "Unix"
               c(osdtl) = ""
            c(hostname) = "64b33ac33fb7"
        c(machine_type) = "PC (64-bit x86-64)"
           c(byteorder) = "lohi"
            c(username) = "statauser"
    ---------------------------------------------------------------------------

Directories and paths
---------------------

    ---------------------------------------------------------------------------
        c(sysdir_stata) = "/usr/local/stata/"        (sysdir)
         c(sysdir_base) = "/usr/local/stata/.."      (sysdir)
         c(sysdir_site) = "/usr/local/ado/"          (sysdir)
         c(sysdir_plus) = "/project/ado/plus/"       (sysdir)
     c(sysdir_personal) = "/project/ado/"            (sysdir)
     c(sysdir_oldplace) = "~/ado/"                   (sysdir)
              c(tmpdir) = "/tmp"
    ---------------------------------------------------------------------------
             c(adopath) = "`"BASE"';`"."';`".."      (adopath)
                 c(pwd) = "/project/code"            (cd)
              c(dirsep) = "/"
    ---------------------------------------------------------------------------

System limits
-------------

    ---------------------------------------------------------------------------
        c(max_N_theory) = 1099511627775
        c(max_k_theory) = 5000                       (set maxvar)
    c(max_width_theory) = 1048576                    (set maxvar)
    ---------------------------------------------------------------------------
          c(max_matdim) = 65534
    ---------------------------------------------------------------------------
        c(max_it_cvars) = 64
        c(max_it_fvars) = 8
    ---------------------------------------------------------------------------
        c(max_macrolen) = 15480200
            c(macrolen) = 645200                     (set maxvar)
             c(charlen) = 67783
          c(max_cmdlen) = 15480216
              c(cmdlen) = 645216                     (set maxvar)
         c(namelenbyte) = 128
         c(namelenchar) = 32
               c(eqlen) = 1337
    ---------------------------------------------------------------------------

Numerical and string limits
---------------------------

    ---------------------------------------------------------------------------
           c(mindouble) = -8.9884656743e+307
           c(maxdouble) = 8.9884656743e+307
           c(epsdouble) = 2.22044604925e-16
      c(smallestdouble) = 2.2250738585e-308
    ---------------------------------------------------------------------------
            c(minfloat) = -1.70141173319e+38
            c(maxfloat) = 1.70141173319e+38
            c(epsfloat) = 1.19209289551e-07
    ---------------------------------------------------------------------------
             c(minlong) = -2147483647
             c(maxlong) = 2147483620
    ---------------------------------------------------------------------------
              c(minint) = -32767
              c(maxint) = 32740
    ---------------------------------------------------------------------------
             c(minbyte) = -127
             c(maxbyte) = 100
    ---------------------------------------------------------------------------
        c(maxstrvarlen) = 2045
       c(maxstrlvarlen) = 2000000000
        c(maxvlabellen) = 32000
    ---------------------------------------------------------------------------

Current dataset
---------------

    ---------------------------------------------------------------------------
               c(frame) = "default"
                   c(N) = 0
                   c(k) = 0
               c(width) = 0
             c(changed) = 0
            c(filename) = ""
            c(filedate) = ""
    ---------------------------------------------------------------------------

Memory settings
---------------

    ---------------------------------------------------------------------------
              c(memory) = 33554432
              c(maxvar) = 5000                       (set maxvar)
            c(niceness) = 5                          (set niceness)
          c(min_memory) = 0                          (set min_memory)
          c(max_memory) = .                          (set max_memory)
         c(segmentsize) = 33554432                   (set segmentsize)
             c(adosize) = 1000                       (set adosize)
     c(max_preservemem) = 1073741824                 (set max_preservemem)
    ---------------------------------------------------------------------------

Output settings
---------------

    ---------------------------------------------------------------------------
                c(more) = "off"                      (set more)
                c(rmsg) = "on"                       (set rmsg)
                  c(dp) = "period"                   (set dp)
            c(linesize) = 79                         (set linesize)
            c(pagesize) = 23                         (set pagesize)
             c(logtype) = "smcl"                     (set logtype)
              c(logmsg) = "on"                       (set logmsg)
             c(noisily) = 1
    ---------------------------------------------------------------------------
             c(iterlog) = "on"                       (set iterlog)
    ---------------------------------------------------------------------------
               c(level) = 95                         (set level)
              c(clevel) = 95                         (set clevel)
    ---------------------------------------------------------------------------
      c(showbaselevels) = ""                         (set showbaselevels)
      c(showemptycells) = ""                         (set showemptycells)
         c(showomitted) = ""                         (set showomitted)
             c(fvlabel) = "on"                       (set fvlabel)
              c(fvwrap) = 1                          (set fvwrap)
            c(fvwrapon) = "word"                     (set fvwrapon)
            c(lstretch) = ""                         (set lstretch)
    ---------------------------------------------------------------------------
             c(cformat) = ""                         (set cformat)
             c(sformat) = ""                         (set sformat)
             c(pformat) = ""                         (set pformat)
    ---------------------------------------------------------------------------
      c(coeftabresults) = "on"                       (set coeftabresults)
                c(dots) = "on"                       (set dots)
    ---------------------------------------------------------------------------
       c(collect_label) = "default"                  (set collect_label)
       c(collect_style) = "default"                  (set collect_style)
         c(table_style) = "table"                    (set table_style)
        c(etable_style) = "etable"                   (set etable_style)
        c(dtable_style) = "dtable"                   (set dtable_style)
        c(collect_warn) = "on"                       (set collect_warn)
    ---------------------------------------------------------------------------

Interface settings
------------------

    ---------------------------------------------------------------------------
             c(linegap) = .                          (set linegap)
       c(scrollbufsize) = .                          (set scrollbufsize)
               c(maxdb) = 50                         (set maxdb)
    ---------------------------------------------------------------------------

Graphics settings
-----------------

    ---------------------------------------------------------------------------
            c(graphics) = "off"                      (set graphics)
              c(scheme) = "s2color"                  (set scheme)
          c(printcolor) = "automatic"                (set printcolor)
       c(min_graphsize) = 1                          (region_options)
       c(max_graphsize) = 100                        (region_options)
    ---------------------------------------------------------------------------

Network settings
----------------

    ---------------------------------------------------------------------------
           c(httpproxy) = "off"                      (set httpproxy)
       c(httpproxyhost) = ""                         (set httpproxyhost)
       c(httpproxyport) = 8080                       (set httpproxyport)
    ---------------------------------------------------------------------------
       c(httpproxyauth) = "off"                      (set httpproxyauth)
       c(httpproxyuser) = ""                         (set httpproxyuser)
         c(httpproxypw) = ""                         (set httpproxypw)
    ---------------------------------------------------------------------------

Trace (program debugging) settings
----------------------------------

    ---------------------------------------------------------------------------
               c(trace) = "off"                      (set trace)
          c(tracedepth) = 32000                      (set tracedepth)
            c(tracesep) = "on"                       (set tracesep)
         c(traceindent) = "on"                       (set traceindent)
         c(traceexpand) = "on"                       (set traceexpand)
         c(tracenumber) = "off"                      (set tracenumber)
         c(tracehilite) = ""                         (set tracehilite)
    ---------------------------------------------------------------------------

Mata settings
-------------

    ---------------------------------------------------------------------------
          c(matastrict) = "off"                      (set matastrict)
            c(matalnum) = "off"                      (set matalnum)
        c(mataoptimize) = "on"                       (set mataoptimize)
           c(matafavor) = "space"                    (set matafavor)
           c(matacache) = 2000                       (set matacache)
            c(matalibs) = "lmatabase;lmataad.."      (set matalibs)
         c(matamofirst) = "off"                      (set matamofirst)
        c(matasolvetol) = .                          (set matasolvetol)
    ---------------------------------------------------------------------------

Java settings
-------------

    ---------------------------------------------------------------------------
        c(java_heapmax) = "4096m"                    (set java_heapmax)
           c(java_home) = "/usr/local/stata/.."      (set java_home)
    ---------------------------------------------------------------------------

LAPACK settings
---------------

    ---------------------------------------------------------------------------
          c(lapack_mkl) = "on"                       (set lapack_mkl)
      c(lapack_mkl_cnr) = "default"                  (set lapack_mkl_cnr)
    ---------------------------------------------------------------------------

putdocx settings
----------------

    ---------------------------------------------------------------------------
      c(docx_hardbreak) = "off"                      (set docx_hardbreak)
       c(docx_paramode) = "off"                      (set docx_paramode)
       c(docx_maxtable) = 500                        (set docx_maxtable)
    ---------------------------------------------------------------------------

putpdf settings
---------------

    ---------------------------------------------------------------------------
        c(pdf_maxtable) = 500                        (set pdf_maxtable)
    ---------------------------------------------------------------------------

Python settings
---------------

    ---------------------------------------------------------------------------
         c(python_exec) = ""                         (set python_exec)
     c(python_userpath) = ""                         (set python_userpath)
    ---------------------------------------------------------------------------

RNG settings
------------

    ---------------------------------------------------------------------------
                 c(rng) = "default"                  (set rng)
         c(rng_current) = "mt64"
            c(rngstate) = "XAA00000000000000.."      (set rngstate)
       c(rngseed_mt64s) = 123456789
           c(rngstream) = 1                          (set rngstream)
    ---------------------------------------------------------------------------

sort settings
-------------

    ---------------------------------------------------------------------------
          c(sortmethod) = "default"                  (set sortmethod)
        c(sort_current) = "fsort"
        c(sortrngstate) = "1001XZA112210f4b1.."      (set sortrngstate)
    ---------------------------------------------------------------------------

Unicode settings
----------------

    ---------------------------------------------------------------------------
           c(locale_ui) = "en_US"                    (set locale_ui)
    c(locale_functions) = "en_US"                    (set locale_functions)
      c(locale_icudflt) = "en_US"                    (unicode locale)
    ---------------------------------------------------------------------------

Other settings
--------------

    ---------------------------------------------------------------------------
                c(type) = "float"                    (set type)
             c(maxiter) = 300                        (set maxiter)
       c(searchdefault) = "all"                      (set searchdefault)
           c(varabbrev) = "on"                       (set varabbrev)
          c(emptycells) = "keep"                     (set emptycells)
             c(fvtrack) = "term"                     (set fvtrack)
              c(fvbase) = "on"                       (set fvbase)
             c(odbcmgr) = "iodbc"                    (set odbcmgr)
          c(odbcdriver) = "unicode"                  (set odbcdriver)
             c(fredkey) = ""                         (set fredkey)
      c(collect_double) = "on"                       (set collect_double)
       c(dtascomplevel) = 1                          (set dtascomplevel)
       c(reshape_favor) = "memory"                   (set reshape_favor)
    ---------------------------------------------------------------------------

Other system values
-------------------

    ---------------------------------------------------------------------------
                  c(pi) = 3.141592653589793
               c(alpha) = "a b c d e f g h i.."
               c(ALPHA) = "A B C D E F G H I.."
                c(Mons) = "Jan Feb Mar Apr M.."
              c(Months) = "January February .."
               c(Wdays) = "Sun Mon Tue Wed T.."
            c(Weekdays) = "Sunday Monday Tue.."
               c(obs_t) = "byte"
                  c(rc) = 0                          (capture)
    ---------------------------------------------------------------------------
r; t=0.00 0:09:16

. query

-------------------------------------------------------------------------------
    Memory settings
      set maxvar           5000       2048-120000; max. vars allowed
      set niceness         5          0-10
      set min_memory       0          0-1600g
      set max_memory       .          32m-1600g or .
      set segmentsize      32m        1m-32g
      set adosize          1000       kilobytes
      set max_preservemem  1g         0-1600g
-------------------------------------------------------------------------------
    Output settings
      set more             off
      set rmsg             on
      set dp               period     may be period or comma
      set linesize         79         characters
      set pagesize         23         lines
      -------------------------------------------------------------------------
      set iterlog          on
      -------------------------------------------------------------------------
      set level            95         percent confidence intervals
      set clevel           95         percent credible intervals
      -------------------------------------------------------------------------
      set showbaselevels              may be empty, off, on, or all
      set showemptycells              may be empty, off, or on
      set showomitted                 may be empty, off, or on
      set fvlabel          on
      set fvwrap           1          
      set fvwrapon         word       may be word or width
      -------------------------------------------------------------------------
      set lstretch                    may be empty, off, or on
      -------------------------------------------------------------------------
      set cformat                     may be empty or a numerical format
      set pformat                     may be empty or a numerical format
      set sformat                     may be empty or a numerical format
      -------------------------------------------------------------------------
      set coeftabresults   on
      set dots             on
      -------------------------------------------------------------------------
      set logtype          smcl       may be smcl or text
      set logmsg           on
      -------------------------------------------------------------------------
      set collect_label    default
      set collect_style    default
      set table_style      table
      set etable_style     etable
      set dtable_style     dtable
      set collect_warn     on
-------------------------------------------------------------------------------
    Interface settings
      set linegap                     (not relevant)
      set scrollbufsize               (not relevant)
      -------------------------------------------------------------------------
      set maxdb                       (not relevant)
-------------------------------------------------------------------------------
    Graphics settings
      set graphics         off
      set scheme           s2color
      set printcolor       automatic  may be automatic, asis, gs1, gs2, gs3
-------------------------------------------------------------------------------
    Network settings
      set httpproxy        off
      set httpproxyhost    
      set httpproxyport    8080
      -------------------------------------------------------------------------
      set httpproxyauth    off
      set httpproxyuser    
      set httpproxypw      
-------------------------------------------------------------------------------
    Update settings
      set update_query                (not relevant)
      set update_interval             (not relevant)
      set update_prompt               (not relevant)
-------------------------------------------------------------------------------
    Trace (programming debugging) settings
      set trace            off
      set tracedepth       32000
      set traceexpand      on
      set tracesep         on
      set traceindent      on
      set tracenumber      off
      set tracehilite      
-------------------------------------------------------------------------------
    Mata settings
      set matastrict       off
      set matalnum         off
      set mataoptimize     on
      set matafavor        space      may be space or speed
      set matacache        2000       kilobytes
      set matalibs         lmatabase;lmataado;lmatabma;lmatacollect;lmatadata;l
> mataerm;lmatafc;lmatagsem;lmatahetdid;lmataivqreg;lmatajm;lmatalasso;lmatamcm
> c;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;l
> matapss;lmatasem;lmatasp;lmatasvy;lmatatab;lmatats
      set matamofirst      off
      set matasolvetol     .          may be . or any double-precision number
-------------------------------------------------------------------------------
    Java settings
      set java_heapmax     4096m
      set java_home        /usr/local/stata/utilities/java/linux-x64/zulu-jdk17
> .0.10/
-------------------------------------------------------------------------------
    LAPACK settings
      set lapack_mkl       on
      set lapack_mkl_cnr   default
-------------------------------------------------------------------------------
    putdocx settings
      set docx_hardbreak   off
      set docx_paramode    off
      set docx_maxtable    500        1-10000
-------------------------------------------------------------------------------
    putpdf settings
      set pdf_maxtable     500        1-10000
-------------------------------------------------------------------------------
    Python settings
      set python_exec      
      set python_userpath  
-------------------------------------------------------------------------------
    RNG settings
      set rng              default    may be default, mt64, mt64s, or kiss32
      set rngstate         XAA00000000000000000000000000000000000000...
      set rngstream        1          rng stream number
-------------------------------------------------------------------------------
    sort settings
      set sortmethod       default    may be default, fsort, or qsort
                           fsort      current sort method
      set sortrngstate     1001XZA112210f4b16c1cb10507a1f38cb440c400...
-------------------------------------------------------------------------------
    Unicode settings
      set locale_ui        en_US
      set locale_functions en_US
-------------------------------------------------------------------------------
    Other settings
      set type             float      may be float or double
      set maxiter          300        max iterations for estimation commands
      set searchdefault    all        may be local, net, or all
      set varabbrev        on
      set emptycells       keep       may be keep or drop
      set fvtrack          term       may be term or factor
      set fvbase           on
      set processors       24         1-24
      set kmp_blocktime    200        time duration in milliseconds
      set odbcmgr          iodbc      may be iodbc or unixodbc
      set odbcdriver       unicode    may be unicode, ansi, or default
      set fredkey          
      set collect_double   on
      set dtascomplevel    1          dtas default compression level; 0-9
      set reshape_favor    default    may be default, memory, or speed
-------------------------------------------------------------------------------
r; t=0.00 0:09:16

. di "=========================="
==========================
r; t=0.00 0:09:16

. 
. /* we're done collecting system info */
. log close system
      name:  system
       log:  /project/logs/system_22_Mar_2025-00_09_16-statauser.log
  log type:  text
 closed on:  22 Mar 2025, 00:09:16
-------------------------------------------------------------------------------
